// let дұрысПароль = "amjilt_the_best";
// let максималдыӘрекеттерСаны = 5;

// for (let әрекет = 0; әрекет < максималдыӘрекеттерСаны; әрекет++) {
//     let пароль = prompt("Парольді енгізіңіз: ");
//     if (пароль === дұрысПароль) {
//         alert("Пароль дұрыс!");
//         break;
//     }
//     if (әрекет === максималдыӘрекеттерСаны - 1) {
//         alert("Қате енгізулер саны көп");
//     }
// }

// let дұрыс_Пароль = "amjilt_the_best";
// let максималды_ӘрекеттерСаны = 5;
// let қатені_ЕнгізуСаны = 0;

// while (қатені_ЕнгізуСаны < максималды_ӘрекеттерСаны) {
//     let пароль_ = prompt("Парольді енгізіңіз: ");
//     if (пароль === дұрыс_Пароль) {
//         alert("Пароль дұрыс!");
//         break;
//     }
//     қатеніЕнгізуСаны++;
//     if (қатеніЕнгізуСаны === максималды_ӘрекеттерСаны) {
//         alert("Қате енгізулер саны көп");
//     }
// }


// let дұрыс__Пароль = "amjilt_the_best";
// let максималды__ӘрекеттерСаны = 5;
// let қатені__ЕнгізуСаны = 0;

// do {
//     let пароль = prompt("Парольді енгізіңіз: ");
//     if (пароль__ === дұрыс__Пароль) {
//         alert("Пароль дұрыс!");
//         break;
//     }
//     қатені__ЕнгізуСаны++;
//     if (қатені__ЕнгізуСаны === максималды__ӘрекеттерСаны) {
//         alert("Қате енгізулер саны көп");
//     }
// } while (қатені__ЕнгізуСаны < максималды__ӘрекеттерСаны);
